IDENTIFICATION DIVISION.
PROGRAM-ID. CONTRIBUTIONMODULE.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
COPY "USER-STRUCTURE.CPY".
PROCEDURE DIVISION USING USER-STRUCTURE.
    DISPLAY "Managing Contributions"
    DISPLAY "Enter your contribution amount:"
    ACCEPT USER-CONTRIBUTION
    PERFORM ADD-CONTRIBUTION
    PERFORM DISPLAY-CONTRIBUTION-INFO
    STOP RUN.

ADD-CONTRIBUTION.
    ADD USER-CONTRIBUTION TO USER-TOTAL-CONTRIBUTIONS.

DISPLAY-CONTRIBUTION-INFO.
    DISPLAY "Your total contributions are: " USER-TOTAL-CONTRIBUTIONS.