IDENTIFICATION DIVISION.
PROGRAM-ID. PENSIONMODULE.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
COPY "USER-STRUCTURE.CPY".
PROCEDURE DIVISION USING USER-STRUCTURE.
    DISPLAY "Managing Pension"
    PERFORM CALCULATE-PENSION
    PERFORM DISPLAY-PENSION-INFO
    STOP RUN.

CALCULATE-PENSION.
    COMPUTE USER-PENSION = (USER-CONTRIBUTIONS * 0.6).

DISPLAY-PENSION-INFO.
    DISPLAY "Your pension is: " USER-PENSION.