01 USER-STRUCTURE.
    05 USER-NAME           PIC X(50).
    05 USER-INCOME         PIC 9(8)V99.
    05 USER-CONTRIBUTIONS  PIC 9(8)V99.
    05 USER-TAX            PIC 9(8)V99.
    05 USER-PENSION        PIC 9(8)V99.
    05 USER-TOTAL-CONTRIBUTIONS PIC 9(8)V99.
    05 USER-CONTRIBUTION   PIC 9(8)V99.